# YOLO26 backbone + capsule neck + open-vocabulary capsule detection head

nc: 80
reg_max: 1
scales:
  n: [0.50, 0.25, 1024]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]
  - [-1, 2, C2PSA, [1024]]

head:
  - [4, 1, CapsProj, [16, 16]]
  - [6, 1, CapsProj, [32, 16]]
  - [10, 1, CapsProj, [64, 16]]

  - [13, 1, CapsAlign, [5, 4]]
  - [[14, 12], 1, CapsRoutev2, [[64, 32], [16, 16], 32, 16]]

  - [15, 1, CapsAlign, [4, 3]]
  - [[16, 11], 1, CapsRoutev2, [[32, 16], [16, 16], 16, 16]]

  - [17, 1, CapsAlign, [3, 4, 16]]
  - [[18, 15], 1, CapsRoutev2, [[16, 32], [16, 16], 32, 16]]

  - [19, 1, CapsAlign, [4, 5, 32]]
  - [[20, 13], 1, CapsRoutev2, [[32, 64], [16, 16], 64, 16]]

  - [[17, 19, 21], 1, CapsuleOpenVocabDetect, [nc, [16, 32, 64], [16, 16, 16], 256, False, True]]
