# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLO26 object detection model with P3/8 - P5/32 outputs
# Model docs: https://docs.ultralytics.com/models/yolo26
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
end2end: True # whether to use end-to-end mode
reg_max: 1 # DFL bins
scales: # model compound scaling constants, i.e. 'model=yolo26n.yaml' will call yolo26.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: 260 layers, 2,572,280 parameters, 2,572,280 gradients, 6.1 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 260 layers, 10,009,784 parameters, 10,009,784 gradients, 22.8 GFLOPs
  m: [0.50, 1.00, 512] # summary: 280 layers, 21,896,248 parameters, 21,896,248 gradients, 75.4 GFLOPs
  l: [1.00, 1.00, 512] # summary: 392 layers, 26,299,704 parameters, 26,299,704 gradients, 93.8 GFLOPs
  x: [1.00, 1.50, 512] # summary: 392 layers, 58,993,368 parameters, 58,993,368 gradients, 209.5 GFLOPs

# YOLO26n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] #  0-P1/2 | n: (1,16,320,320)
  - [-1, 1, Conv, [128, 3, 2]] #  1-P2/4 | n: (1,32,160,160)
  - [-1, 2, C3k2, [256, False, 0.25]]  # n: (1,64,160,160)
  - [-1, 1, Conv, [256, 3, 2]] #  3-P3/8 | n: (1,64,80,80)
  - [-1, 2, C3k2, [512, False, 0.25]]  # n: (1,128,80,80)
  - [-1, 1, Conv, [512, 3, 2]] #  5-P4/16 | n: (1,128,40,40)
  - [-1, 2, C3k2, [512, True]]  # n: (1,128,40,40)
  - [-1, 1, Conv, [1024, 3, 2]] #  7-P5/32 | n: (1,256,20,20)
  - [-1, 2, C3k2, [1024, True]]  # n: (1,256,20,20)
  - [-1, 1, SPPF, [1024, 5, 3, True]] #  9 | n: (1,256,20,20)
  - [-1, 2, C2PSA, [1024]] #  10 | n: (1,256,20,20)

# YOLO26n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # n: (1,256,40,40)
  - [[-1, 6], 1, Concat, [1]] #  cat backbone P4 | n: (1,384,40,40)
  - [-1, 2, C3k2, [512, True]] #  13 | n: (1,128,40,40)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # n: (1,128,80,80)
  - [[-1, 4], 1, Concat, [1]] #  cat backbone P3 | n: (1,256,80,80)
  - [-1, 2, C3k2, [256, True]] #  16 (P3/8-small) | n: (1,64,80,80)

  - [-1, 1, Conv, [256, 3, 2]]  # n: (1,64,40,40)
  - [[-1, 13], 1, Concat, [1]] #  cat head P4 | n: (1,192,40,40)
  - [-1, 2, C3k2, [512, True]] #  19 (P4/16-medium) | n: (1,128,40,40)

  - [-1, 1, Conv, [512, 3, 2]]  # n: (1,128,20,20)
  - [[-1, 10], 1, Concat, [1]] #  cat head P5 | n: (1,384,20,20)
  - [-1, 1, C3k2, [1024, True, 0.5, True]] #  22 (P5/32-large) | n: (1,256,20,20)

  - [[16, 19, 22], 1, Detect, [nc]] #  Detect(P3, P4, P5) | n: [(1,300,6), dict]
