# Ultralytics AGPL-3.0 License - https://ultralytics.com/license

# YOLO26 + capsule-style neck
# Notes:
# - CapsProj args: [K_base, P]
# - CapsRoute args: [K_in_list, P_in_list, K_out, P_out, kernel_size(optional)]
#   K_in_list: input capsule type counts per source (must match source channels)
#   P_in_list: input pose dims per source (same length as K_in_list)
#   K_out: output capsule type count (base value, width-scaled by parser)
#   P_out: output pose dim
#   kernel_size: ConvSelfRouting grouped-conv kernel (default=3)
#   output channels = K_out_eff * (P_out + 1)

# Parameters
nc: 80
end2end: True
reg_max: 1
scales:
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] #  0 | n: (1,16,320,320)
  - [-1, 1, Conv, [128, 3, 2]] #  1 | n: (1,32,160,160)
  - [-1, 2, C3k2, [256, False, 0.25]] #  2 | n: (1,64,160,160)
  - [-1, 1, Conv, [256, 3, 2]] #  3 | n: (1,64,80,80)
  - [-1, 2, C3k2, [512, False, 0.25]] #  4 | n: (1,128,80,80)
  - [-1, 1, Conv, [512, 3, 2]] #  5 | n: (1,128,40,40)
  - [-1, 2, C3k2, [512, True]] #  6 | n: (1,128,40,40)
  - [-1, 1, Conv, [1024, 3, 2]] #  7 | n: (1,256,20,20)
  - [-1, 2, C3k2, [1024, True]] #  8 | n: (1,256,20,20)
  - [-1, 1, SPPF, [1024, 5, 3, True]] #  9 | n: (1,256,20,20)
  - [-1, 2, C2PSA, [1024]] #  10 | n: (1,256,20,20)

head:
  # 1) project P3/P4/P5 backbone features to packed capsules
  - [4,  1, CapsProj, [4, 64]] #  11 cap3 | n: (1,65,80,80)
  - [6,  1, CapsProj, [8, 64]] #  12 cap4 | n: (1,130,40,40)
  - [10, 1, CapsProj, [16, 64]] #  13 cap5 | n: (1,260,20,20)

  # 2) upsample cap5 -> lvl4 and merge with cap4
  - [13, 1, CapsAlign, [5, 4]] #  14 | n: (1,260,40,40)
  - [[14, 12], 1, CapsRoute, [[16, 8], [64, 64], 8, 64]] #  15 merged cap4 | n: (1,130,40,40)

  # 3) upsample merged cap4 -> lvl3 and merge with cap3
  - [15, 1, CapsAlign, [4, 3]] #  16 | n: (1,130,80,80)
  - [[16, 11], 1, CapsRoute, [[8, 4], [64, 64], 4, 64]] #  17 merged cap3 | n: (1,65,80,80)

  # 4) downsample merged cap3 -> lvl4 and merge with merged cap4
  - [17, 1, CapsAlign, [3, 4, 4]] #  18 | n: (1,65,40,40)
  - [[18, 15], 1, CapsRoute, [[4, 8], [64, 64], 8, 64]] #  19 refined cap4 | n: (1,130,40,40)

  # 5) downsample refined cap4 -> lvl5 and merge with cap5
  - [19, 1, CapsAlign, [4, 5, 8]] #  20 | n: (1,130,20,20)
  - [[20, 13], 1, CapsRoute, [[8, 16], [64, 64], 16, 64]] #  21 refined cap5 | n: (1,260,20,20)

  - [[17, 19, 21], 1, CapsuleDetect, [nc, [4, 8, 16], [64, 64, 64]]] #  29 CapsHead Detect | n: [(1,300,6), dict]
