# Deformable capsule backbone + YOLO-like head

# Parameters
nc: 80
depth_multiple: 0.33
width_multiple: 1.00
end2end: True
reg_max: 1

# Backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [16, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [32, 3, 2]] # 1-P2/4
  # DeformableCapsBlock keeps channels (c1 == c2) so Ultralytics channel inference stays correct.
  - [-1, 1, DeformableCapsBlock, [32, 32, 2, 2, 2, 2, 2, 3, 1]] # 2-P2/4
  - [-1, 1, Conv, [64, 3, 2]] # 3-P3/8
  - [-1, 1, DeformableCapsBlock, [64, 64, 2, 2, 2, 2, 2, 3, 1]] # 4-P3/8
  - [-1, 1, Conv, [128, 3, 2]] # 5-P4/16
  - [-1, 1, DeformableCapsBlock, [128, 128, 2, 2, 2, 2, 2, 3, 1]] # 6-P4/16
  - [-1, 1, Conv, [256, 3, 2]] # 7-P5/32
  - [-1, 1, DeformableCapsBlock, [256, 256, 2, 2, 2, 2, 2, 3, 1]] # 8-P5/32

# Head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 9
  - [[-1, 6], 1, Concat, [1]] # 10
  - [-1, 2, C3k2, [128, True]] # 11

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 12
  - [[-1, 4], 1, Concat, [1]] # 13
  - [-1, 2, C3k2, [64, True]] # 14 (P3/8)

  - [-1, 1, Conv, [64, 3, 2]] # 15
  - [[-1, 11], 1, Concat, [1]] # 16
  - [-1, 2, C3k2, [128, True]] # 17 (P4/16)

  - [-1, 1, Conv, [128, 3, 2]] # 18
  - [[-1, 8], 1, Concat, [1]] # 19
  - [-1, 1, C3k2, [256, True, 0.5, True]] # 20 (P5/32)

  - [[14, 17, 20], 1, Detect, [nc]] # Detect(P3, P4, P5)
